In [2]:
import numpy as np
import pandas as pd

In [3]:
dict ={'india':10000, 'japan':50000,'china':540000}
c = pd.Series(dict)
c

india     10000
japan     50000
china    540000
dtype: int64

In [4]:
b = pd.Series(dict,index=['a','japan','c'])
print(b)

a            NaN
japan    50000.0
c            NaN
dtype: float64

In [5]:
pd.Series(5,index=[100,200,300])

100    5
200    5
300    5
dtype: int64

### DATA FRAMES

In [6]:
d = {'col1': [0, 1, 2, 3], 'col2': pd.Series([2, 3], index=[2, 3])}
pd.DataFrame(data=d, index=[0, 1, 2, 3])

   col1  col2
0     0   NaN
1     1   NaN
2     2   2.0
3     3   3.0

In [7]:
cat = {'name':['nithiya','vino','gokul','sagana'],'regno':[15,16,17,19]}
pd.DataFrame(cat) ### df.head is starting value and df.tail is ending value of the table

      name  regno
0  nithiya     15
1     vino     16
2    gokul     17
3   sagana     19

In [8]:
b = pd.read_csv("C:/Users/NITHIYAGOKULAVASAGI/OneDrive/Documents/pandas.csv",index_col="age")
b # pd.read_csv is used to import a CSV file in pandas

        name        place
age
18   nithiya        pondy
17      vino        pondy
17    sagana        pondy
18     gokul  kalakurichi

In [9]:
b.iloc[0] # iloc is to identify the particular element in large amount of data ( can also do indexing in that itself seperating by commas)

name     nithiya
place      pondy
Name: 18, dtype: object

### 06.05.23,TUESDAY

In [10]:
# pandas is extremely powerful in excel

In [11]:
# series : it is very simlar to numpy arrays

In [12]:
# cearting a series

In [13]:
lab = ['a','b','c','d']
my_list = [10,20,30,40]
arr = np.array([15,13,17,15])
d = {'name':['abu','nit','kai'],'age':[15,12,17]}

In [14]:
pd.Series(data = my_list,index = ['a','b','c','d']) # using list

a    10
b    20
c    30
d    40
dtype: int64

In [15]:
d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data=d)
ser

a    1
b    2
c    3
dtype: int64

In [16]:
d = {'a': 1, 'b': 2, 'c': 3}
s =[5,6,7]
f =['ay','ni','jk']
ser = pd.Series(data=s, index=[f[0:3:1]])
ser

ay    5
ni    6
jk    7
dtype: int64

In [17]:
ser.iloc[1]

6

In [18]:
pd.Series(my_list,lab)

a    10
b    20
c    30
d    40
dtype: int64

In [19]:
pd.Series(arr)

0    15
1    13
2    17
3    15
dtype: int32

In [20]:
pd.Series(data = lab)

0    a
1    b
2    c
3    d
dtype: object

In [21]:
g = pd.Series(data = lab,index = [11.2,15.16,19.22,20.0])
print(g)

11.20    a
15.16    b
19.22    c
20.00    d
dtype: object

In [22]:
g = pd.Series(data = lab,index = [True,False,False,True]) # index with boolean values
print(g)

True     a
False    b
False    c
True     d
dtype: object

In [23]:
g = pd.Series(data = lab,index = [1001,1111,1110,1101]) # index with binary values
print(g)

1001    a
1111    b
1110    c
1101    d
dtype: object

In [24]:
dict =pd.Series({'india':10000, 'japan':50000,'china':540000})
tamil =pd.Series({'india':15000, 'madurai':500,'china':60000})
print(dict)
print(tamil)

india     10000
japan     50000
china    540000
dtype: int64
india      15000
madurai      500
china      60000
dtype: int64

In [25]:
dict + tamil

china      600000.0
india       25000.0
japan           NaN
madurai         NaN
dtype: float64

In [26]:
dict - tamil

china      480000.0
india       -5000.0
japan           NaN
madurai         NaN
dtype: float64

In [27]:
dict * tamil

china      3.240000e+10
india      1.500000e+08
japan               NaN
madurai             NaN
dtype: float64

In [28]:
dict / tamil

china      9.000000
india      0.666667
japan           NaN
madurai         NaN
dtype: float64

In [29]:
dict // tamil

china      9.0
india      0.0
japan      NaN
madurai    NaN
dtype: float64

In [30]:
dict^ tamil

china       True
india       True
japan       True
madurai    False
dtype: bool

In [35]:
data = [[1,2,3,4,5,6],[4,5,6,7,8,5],[45,46,10,20,13,14]]
index = ['A','B','C']
columns = ['W','P','L','O','Y','G']
df = pd.DataFrame(data,index,columns)
df

    W   P   L   O   Y   G
A   1   2   3   4   5   6
B   4   5   6   7   8   5
C  45  46  10  20  13  14

### 08.06.23 ,THURSDAY

In [7]:
import pandas as pd
dat = [[1,2,3,4,5,6],[14,15,26,7,5,6]]
index = ['A','B']
columns = ['W','E','U','O','P','K']
df = pd.DataFrame(dat,index,columns)
df

    W   E   U  O  P  K
A   1   2   3  4  5  6
B  14  15  26  7  5  6

In [8]:
data1 = [['nithiya',18,'pondy',516],['vinoraj',17,'chennai',568],['gokul',18,'kalakurichi',526],['sagana',17,'madurai',518]]
index = [1,2,3,4]
columns = ['NAME','AGE','PLACE','MARK']
df = pd.DataFrame(data1,index,columns)
df

      NAME  AGE        PLACE  MARK
1  nithiya   18        pondy   516
2  vinoraj   17      chennai   568
3    gokul   18  kalakurichi   526
4   sagana   17      madurai   518

In [9]:
data1[3]

['sagana', 17, 'madurai', 518]

In [10]:
dat[1][2:5]

[26, 7, 5]

In [14]:
dat[1][:2]

[14, 15]

In [15]:
import numpy as np

In [21]:
arr_1 = np.array([[546,798,231,375],[754,857,987,465],[155,789,369,456]])
print(arr_1)

[[546 798 231 375]
 [754 857 987 465]
 [155 789 369 456]]

### 09.06.23 FRIDAY

In [23]:
import pandas as pd
import numpy as np
from numpy.random import  randint

In [29]:
lab = ['a','b','c','d']
my_list = [10,20,30,40]
arr = np.array([15,13,17,15])
d = {'name':['abu','nit','kai'],'age':[15,12,17]}
heloo  = pd.Series(data = my_list) 
heloo

0    10
1    20
2    30
3    40
dtype: int64

In [47]:
data1 = [['nithiya',18,'pondy',516],['vinoraj',17,'chennai',568],['gokul',18,'kalakurichi',526],['sagana',17,'madurai',518]]
index = [1,2,3,4]
columns = ['NAME','AGE','PLACE','MARK']
df = pd.DataFrame(data1,index,columns)
df

      NAME  AGE        PLACE  MARK
1  nithiya   18        pondy   516
2  vinoraj   17      chennai   568
3    gokul   18  kalakurichi   526
4   sagana   17      madurai   518

In [48]:
df['NAME'][2:]

3     gokul
4    sagana
Name: NAME, dtype: object

In [59]:
df1 = df[['PLACE','MARK']]
df1

         PLACE  MARK
1        pondy   516
2      chennai   568
3  kalakurichi   526
4      madurai   518

In [61]:
df1[2:]

         PLACE  MARK
3  kalakurichi   526
4      madurai   518

In [62]:
type(df1[2:])

pandas.core.frame.DataFrame

In [133]:
m1 = [[15,12,14],[17,26,15],[18,12,19],[78,12,30],[45,12,10]]
col = ['m1','m2','m3']
index =[1,2,3,4,5]
df = pd.DataFrame(m1,index,col)
df

   m1  m2  m3
1  15  12  14
2  17  26  15
3  18  12  19
4  78  12  30
5  45  12  10

In [134]:
df['total'] = df['m1'] + df['m2'] +df['m3']
df['total']

1     41
2     58
3     49
4    120
5     67
Name: total, dtype: int64

In [99]:
df

   m1  m2  m3  total
1  15  12  14     41
2  17  26  15     58
3  18  12  19     49
4  78  12  30    120
5  45  12  10     67

In [100]:
df.loc[2]

m1       17
m2       26
m3       15
total    58
Name: 2, dtype: int64

In [5]:
data = [['dhoni','CSK',5,5,2],['hardhik','GT',3,2,'NaN'],['rhohit','MI',2,1,2],['virat','RCB',1,5,'NaN'],['kl raghul','LSG',10,1,3],['shikar','SRH',5,3,1]]
column = ['name','team','wickect','overs','dotball']
index = [1,2,3,4,5,6]
df = pd.DataFrame(data,index,column)
df

        name team  wickect  overs dotball
1      dhoni  CSK        5      5       2
2    hardhik   GT        3      2     NaN
3     rhohit   MI        2      1       2
4      virat  RCB        1      5     NaN
5  kl raghul  LSG       10      1       3
6     shikar  SRH        5      3       1

In [6]:
df2 = df[['name','team','overs']]
df2

        name team  overs
1      dhoni  CSK      5
2    hardhik   GT      2
3     rhohit   MI      1
4      virat  RCB      5
5  kl raghul  LSG      1
6     shikar  SRH      3

In [123]:
df2[3:]

        name team  overs
4      virat  RCB      5
5  kl raghul  LSG      1
6     shikar  SRH      3

In [7]:
df2[1:]

        name team  overs
2    hardhik   GT      2
3     rhohit   MI      1
4      virat  RCB      5
5  kl raghul  LSG      1
6     shikar  SRH      3

### 10.06.23 SATURDAY

In [8]:
dict_1 ={'fruit':'apple', 'name':'AAA','place':'chennai'}
coin = pd.Series(dict_1)
coin

fruit      apple
name         AAA
place    chennai
dtype: object

In [11]:
type(coin)

pandas.core.series.Series

In [13]:
data = [['abi',15,'pondy',520,'aaa'],['anu']]
index =[1,2]
column  = ['NAME','AGE','PALCE','TOTAL','SCHOOL']
df = pd.DataFrame(data, index,column)
df

  NAME  AGE  PALCE  TOTAL SCHOOL
1  abi   15  pondy    520    aaa

### 15.06.23 THURSDAY

### MISSING DATA

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A':[1,2,np. nan,4],
                  'B':[5,np.nan,np.nan,8],
                  'C':[10,20,30,40]})
df# NAN not an empty

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

### REMOVING MISSING DATA

In [3]:
df.dropna()# used for row

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  40

In [4]:
x = df.dropna(axis = 1) # axis = 1 is column
x

    C
0  10
1  20
2  30
3  40

In [5]:
type(x)

pandas.core.frame.DataFrame

In [6]:
#thershold

In [7]:
df.dropna(thresh= 2) # the row with 2 and above rwos with NAN values are removed

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
3  4.0  8.0  40

In [8]:
# filling

In [9]:
df.fillna(value = 'VALUE')

       A      B   C
0    1.0    5.0  10
1    2.0  VALUE  20
2  VALUE  VALUE  30
3    4.0    8.0  40

In [10]:
df['A'].fillna (value = 15)

0     1.0
1     2.0
2    15.0
3     4.0
Name: A, dtype: float64

In [11]:
df['A'].fillna(value=df['A'].mean()) # it first execute the inner function and goes for outre function

0    1.000000
1    2.000000
2    2.333333
3    4.000000
Name: A, dtype: float64

### GROUP BY

In [26]:
df = pd.read_csv('C:/Users/NITHIYAGOKULAVASAGI/OneDrive/Documents/pandas.csv')
df

         name  age        place  total grade   avg
0     nithiya   18        pondy    520     A  86.2
1        vino   17        pondy    963     S  74.2
2      sagana   17        pondy    741     D  96.3
3       gokul   18  kalakurichi    753     F  75.3
4        AAAA   15        kovai    951     B  62.0
5         BBB   10      chennai    123     E  96.0
6         CCC   12       mumbai    456     C  96.0
7         DDD    3        delhi    789     D  96.0
8        vasu   18        pondy    789     A  52.0
9       gogul    8        pondy    963     A  85.0
10  kavipriya   20      chennai    148     S  86.5
11    sadhana   16       mumbai    138     A  99.0

In [27]:
df.head() # default it shows 5 rows

      name  age        place  total grade   avg
0  nithiya   18        pondy    520     A  86.2
1     vino   17        pondy    963     S  74.2
2   sagana   17        pondy    741     D  96.3
3    gokul   18  kalakurichi    753     F  75.3
4     AAAA   15        kovai    951     B  62.0

In [28]:
df.describe() # it is used for only numberical values

             age       total        avg
count  12.000000   12.000000  12.000000
mean   14.333333  611.166667  83.708333
std     5.069218  326.466992  15.072821
min     3.000000  123.000000  52.000000
25%    11.500000  379.000000  75.025000
50%    16.500000  747.000000  86.350000
75%    18.000000  829.500000  96.000000
max    20.000000  963.000000  99.000000

In [29]:
df.groupby('name')

In [30]:
df.groupby('age').mean()

C:\Users\NITHIYAGOKULAVASAGI\AppData\Local\Temp\ipykernel_8352\149526435.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('age').mean()

          total        avg
age
3    789.000000  96.000000
8    963.000000  85.000000
10   123.000000  96.000000
12   456.000000  96.000000
15   951.000000  62.000000
16   138.000000  99.000000
17   852.000000  85.250000
18   687.333333  71.166667
20   148.000000  86.500000

In [31]:
df.groupby('name').mean().sort_index(ascending=True)

C:\Users\NITHIYAGOKULAVASAGI\AppData\Local\Temp\ipykernel_8352\585239043.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('name').mean().sort_index(ascending=True)

            age  total   avg
name
AAAA       15.0  951.0  62.0
BBB        10.0  123.0  96.0
CCC        12.0  456.0  96.0
DDD         3.0  789.0  96.0
gogul       8.0  963.0  85.0
gokul      18.0  753.0  75.3
kavipriya  20.0  148.0  86.5
nithiya    18.0  520.0  86.2
sadhana    16.0  138.0  99.0
sagana     17.0  741.0  96.3
vasu       18.0  789.0  52.0
vino       17.0  963.0  74.2

In [32]:
df.groupby('total').count()

       name  age  place  grade  avg
total
123       1    1      1      1    1
138       1    1      1      1    1
148       1    1      1      1    1
456       1    1      1      1    1
520       1    1      1      1    1
741       1    1      1      1    1
753       1    1      1      1    1
789       2    2      2      2    2
951       1    1      1      1    1
963       2    2      2      2    2

In [33]:
df.groupby('grade').min()

            name  age        place  total   avg
grade
A          gogul    8       mumbai    138  52.0
B           AAAA   15        kovai    951  62.0
C            CCC   12       mumbai    456  96.0
D            DDD    3        delhi    741  96.0
E            BBB   10      chennai    123  96.0
F          gokul   18  kalakurichi    753  75.3
S      kavipriya   17      chennai    148  74.2

In [34]:
df.groupby('place').max()

                  name  age  total grade   avg
place
chennai      kavipriya   20    148     S  96.0
delhi              DDD    3    789     D  96.0
kalakurichi      gokul   18    753     F  75.3
kovai             AAAA   15    951     B  62.0
mumbai         sadhana   16    456     C  99.0
pondy             vino   18    963     S  96.3

In [35]:
df.groupby('age').std()

C:\Users\NITHIYAGOKULAVASAGI\AppData\Local\Temp\ipykernel_8352\3237405632.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('age').std()

          total        avg
age
3           NaN        NaN
8           NaN        NaN
10          NaN        NaN
12          NaN        NaN
15          NaN        NaN
16          NaN        NaN
17   156.977705  15.627060
18   146.028536  17.470642
20          NaN        NaN

In [36]:
df.groupby('total').median()

C:\Users\NITHIYAGOKULAVASAGI\AppData\Local\Temp\ipykernel_8352\3616555503.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.median is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('total').median()

        age   avg
total
123    10.0  96.0
138    16.0  99.0
148    20.0  86.5
456    12.0  96.0
520    18.0  86.2
741    17.0  96.3
753    18.0  75.3
789    10.5  74.0
951    15.0  62.0
963    12.5  79.6

In [37]:
df.groupby('total').sum()

C:\Users\NITHIYAGOKULAVASAGI\AppData\Local\Temp\ipykernel_8352\209748116.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('total').sum()

       age    avg
total
123     10   96.0
138     16   99.0
148     20   86.5
456     12   96.0
520     18   86.2
741     17   96.3
753     18   75.3
789     21  148.0
951     15   62.0
963     25  159.2

### 16.06.23 FRIDAY

### OPERRATIONS IN DATA FRAME

In [54]:
import pandas as pd
data = [['dhoni','CSK',5,5,2],['hardhik','GT',3,2,'NaN'],['rhohit','MI',2,1,2],['virat','RCB',1,5,'NaN'],['kl raghul','LSG',10,1,3],['shikar','SRH',5,3,1]]
column = ['name','team','wickect','overs','dotball']
index = [1,2,3,4,5,6]
df_1 =pd.DataFrame(data,index,column)
df_1

        name team  wickect  overs dotball
1      dhoni  CSK        5      5       2
2    hardhik   GT        3      2     NaN
3     rhohit   MI        2      1       2
4      virat  RCB        1      5     NaN
5  kl raghul  LSG       10      1       3
6     shikar  SRH        5      3       1

In [55]:
# unique value

In [57]:
df_1['overs'].unique() # only unique value

array([5, 2, 1, 3], dtype=int64)

In [59]:
df_1['wickect'].nunique() # shows how many number of unique value

5

In [61]:
df_1['overs'].value_counts() # is rerurns how many times it is repeated

5    2
1    2
2    1
3    1
Name: overs, dtype: int64

In [63]:
df_1.drop_duplicates() # it does not show the repeated value and project only ones

        name team  wickect  overs dotball
1      dhoni  CSK        5      5       2
2    hardhik   GT        3      2     NaN
3     rhohit   MI        2      1       2
4      virat  RCB        1      5     NaN
5  kl raghul  LSG       10      1       3
6     shikar  SRH        5      3       1

In [67]:
df_1.drop_duplicates(subset=('overs'),keep='last') # can also pass the argument

        name team  wickect  overs dotball
2    hardhik   GT        3      2     NaN
4      virat  RCB        1      5     NaN
5  kl raghul  LSG       10      1       3
6     shikar  SRH        5      3       1

In [100]:
for val in df_1:
    df['val'] = df['overs'] + 2
    df_1 =df['val']
    val

In [80]:
df_1['new column'] = df_1['overs'] * 2
df_1

        name team  wickect  overs dotball  new column
1      dhoni  CSK        5      5       2          10
2    hardhik   GT        3      2     NaN           4
3     rhohit   MI        2      1       2           2
4      virat  RCB        1      5     NaN          10
5  kl raghul  LSG       10      1       3           2
6     shikar  SRH        5      3       1           6

In [2]:
a= 10
b=0
c=a/b
while True:
    try:
        val  = print("enter a non-zero value:")
        a = 10
        c = a/ val
        print("The answer is:",val)
except valueerror:

SyntaxError: expected 'except' or 'finally' block (1756655225.py, line 10)

In [7]:
a = int(input('enter a first value:'))
while True:
    try:
        val = int(input("Enter a non-zero value: "))
        if val == 0:
            raise ZeroDivisionError("Zero value entered")
        c = a / val
        print("The answer is:", int(c))
        break  # Exit the loop if the division is successful
    except ZeroDivisionError as e:
        print("Error:", e)
    except ValueError:
        print("Invalid input. Please enter a valid non-zero number.")

enter a first value:55
Enter a non-zero value: 5
The answer is: 11

### SORTING AND ORDERING

In [9]:
import pandas as pd 
import numpy as np

In [15]:
data = [['dhoni','CSK',5,5,2],['hardhik','GT',3,2,'NaN'],['rhohit','MI',2,1,2],['virat','RCB',1,5,'NaN'],['kl raghul','LSG',10,1,3],['shikar','SRH',5,3,1],['Dhoni','CSK',5,5,2]]
column = ['name','team','wickect','overs','dotball']
index = [1,2,3,4,5,6,7]
df =pd.DataFrame(data,index,column)
df

        name team  wickect  overs dotball
1      dhoni  CSK        5      5       2
2    hardhik   GT        3      2     NaN
3     rhohit   MI        2      1       2
4      virat  RCB        1      5     NaN
5  kl raghul  LSG       10      1       3
6     shikar  SRH        5      3       1
7      Dhoni  CSK        5      5       2

In [16]:
df.sort_values(by = ['name'])

        name team  wickect  overs dotball
7      Dhoni  CSK        5      5       2
1      dhoni  CSK        5      5       2
2    hardhik   GT        3      2     NaN
5  kl raghul  LSG       10      1       3
3     rhohit   MI        2      1       2
6     shikar  SRH        5      3       1
4      virat  RCB        1      5     NaN

In [19]:
df.sort_values(['name','team'])

        name team  wickect  overs dotball
7      Dhoni  CSK        5      5       2
1      dhoni  CSK        5      5       2
2    hardhik   GT        3      2     NaN
5  kl raghul  LSG       10      1       3
3     rhohit   MI        2      1       2
6     shikar  SRH        5      3       1
4      virat  RCB        1      5     NaN

### CONCATINATING AND MERGING

In [27]:
data = [['dhoni','CSK',5,5,2],['hardhik','GT',3,2,'NaN'],['rhohit','MI',2,1,2],['virat','RCB',1,5,'NaN']]
column = ['name','team','wickect','overs','dotball']
index = [1,2,3,4,]
df1 = pd.DataFrame(data,index,column)
df1

      name team  wickect  overs dotball
1    dhoni  CSK        5      5       2
2  hardhik   GT        3      2     NaN
3   rhohit   MI        2      1       2
4    virat  RCB        1      5     NaN

In [26]:
data = [['dhoni',15,'pondy',520,'s'],['hardhik',14,'delhi',562,'s'],['rhohit',18,'pondy',531,'a'],['virat',18,'delhi',520,'d']]
column = ['name','age','place','marks','grade']
index = [1,2,3,4,]
df2 = pd.DataFrame(data,index,column)
df2

      name  age  place  marks grade
1    dhoni   15  pondy    520     s
2  hardhik   14  delhi    562     s
3   rhohit   18  pondy    531     a
4    virat   18  delhi    520     d

In [30]:
pd.concat([df1,df2]) # here it must be given in square bracket

      name team  wickect  overs dotball   age  place  marks grade
1    dhoni  CSK      5.0    5.0       2   NaN    NaN    NaN   NaN
2  hardhik   GT      3.0    2.0     NaN   NaN    NaN    NaN   NaN
3   rhohit   MI      2.0    1.0       2   NaN    NaN    NaN   NaN
4    virat  RCB      1.0    5.0     NaN   NaN    NaN    NaN   NaN
1    dhoni  NaN      NaN    NaN     NaN  15.0  pondy  520.0     s
2  hardhik  NaN      NaN    NaN     NaN  14.0  delhi  562.0     s
3   rhohit  NaN      NaN    NaN     NaN  18.0  pondy  531.0     a
4    virat  NaN      NaN    NaN     NaN  18.0  delhi  520.0     d